В своей курсовой  я бы хотела проследить зависимость уровня зп от размера компании, рассмотреть как изменилась заработная плата в компаниях разных размеров за последние года, основываясь на данные из датасета в ссылке: https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries?resource=download

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
df = pd.read_csv('/Users/daralobzova/Downloads/ds_salaries.csv')

In [3]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

столбцы в датасете:<br>
work_year - рабочий год <br>
experience_level - опыт работы <br>
employment_type - тип занятости <br>
job_title - должность <br>
salary - размер зароботной платы <br>
salary_currency - валюта з/п <br>
salary_in_usd - з/п в долларах США <br>
employee_residence - место жительства сотрудника <br>
remote_ratio - дистанционное соотношение <br>
company_location - место нахождения компании <br>
company_size - размер компании <br>

#### 1. Проведем анализ уровня зароботной платы сотрудника от размера компании. За основу возьмем уровень заработной платы в долларах США.

In [4]:
sample1 = df[['salary_in_usd', 'company_size']]
sample1

     salary_in_usd company_size
0            79833            L
1           260000            S
2           109024            M
3            20000            S
4           150000            L
..             ...          ...
602         154000            M
603         126000            M
604         129000            M
605         150000            M
606         200000            L

[607 rows x 2 columns]

In [5]:
sample1['company_size'].value_counts()

M    326
L    198
S     83
Name: company_size, dtype: int64

Компании в датафрейме разделены на S (меньше 50 сотрудников), M (от 50 до 250 сотрудников), L (больше 250 сотрудников). <br> Разобьем зарплаты сотрудников по размерам компаний.

In [6]:
S = sample1[sample1['company_size'] == 'S']
S

     salary_in_usd company_size
1           260000            S
3            20000            S
6           190000            S
9           125000            S
10           51321            S
..             ...          ...
510         150000            S
512          65000            S
513          71444            S
515          48000            S
522          20000            S

[83 rows x 2 columns]

In [7]:
S = S.drop(columns='company_size') 
S

     salary_in_usd
1           260000
3            20000
6           190000
9           125000
10           51321
..             ...
510         150000
512          65000
513          71444
515          48000
522          20000

[83 rows x 1 columns]

In [8]:
S.median()

salary_in_usd    65000.0
dtype: float64

In [9]:
M = sample1[sample1['company_size'] == 'M']
M

     salary_in_usd company_size
2           109024            M
12           39916            M
18            5707            M
19           56000            M
20           43331            M
..             ...          ...
601          52000            M
602         154000            M
603         126000            M
604         129000            M
605         150000            M

[326 rows x 2 columns]

In [10]:
M = M.drop(columns='company_size') 
M

     salary_in_usd
2           109024
12           39916
18            5707
19           56000
20           43331
..             ...
601          52000
602         154000
603         126000
604         129000
605         150000

[326 rows x 1 columns]

In [11]:
M.median()

salary_in_usd    113188.0
dtype: float64

In [12]:
L = sample1[sample1['company_size'] == 'L']
L

     salary_in_usd company_size
0            79833            L
4           150000            L
5            72000            L
7            35735            L
8           135000            L
..             ...          ...
524         135000            L
525         177000            L
550         205300            L
551         140400            L
606         200000            L

[198 rows x 2 columns]

In [13]:
L = L.drop(columns='company_size') 
L

     salary_in_usd
0            79833
4           150000
5            72000
7            35735
8           135000
..             ...
524         135000
525         177000
550         205300
551         140400
606         200000

[198 rows x 1 columns]

In [14]:
L.median()

salary_in_usd    100000.0
dtype: float64

In [15]:
S = np.array(S, dtype=np.float64)
M = np.array(M, dtype=np.float64)
L = np.array(L, dtype=np.float64)

In [16]:
n1 = S.shape[0]
n2 = M.shape[0]
n3 = L.shape[0]

Найдем среднюю з/п по критерию размера компании:

In [17]:
y1_mean = S.mean()
y2_mean = M.mean()
y3_mean = L.mean()

y1_mean, y2_mean, y3_mean

(77632.67469879518, 116905.46625766871, 119242.99494949495)

Соберём все значения заработных плат в один массив:

In [18]:
y = np.concatenate([S, M, L])

Общая средняя зарплат:

In [19]:
y_mean = y.mean()
y_mean

112297.86985172982

Найдём значения 𝑆𝐹 и 𝑆𝑟𝑒𝑠:

In [20]:
S2_F = n1 * (y1_mean - y_mean) ** 2 + n2 * (y2_mean - y_mean) ** 2 + n3 * (y3_mean - y_mean) ** 2

S2_res = ((S - y1_mean) ** 2).sum() + ((M - y2_mean) ** 2).sum() + ((L - y3_mean) ** 2).sum()

S2_F, S2_res

(116210532616.37767, 2934958661268.341)

Проверим выполнение равенства 𝑆2=𝑆2𝐹+𝑆2𝑟𝑒𝑠:

In [21]:
((y - y_mean) ** 2).sum()

3051169193884.718

In [22]:
116210532616.377 + 2934958661268.341

3051169193884.718

равенство выполняется

Запишем оценки дисперсий:

In [23]:
k = 3
n = n1 + n2 + n3

k1 = k - 1
k2 = n - k

sigma2_F = S2_F / k1
sigma2_res = S2_res / k2

sigma2_F, sigma2_res

(58105266308.188835, 4859203081.570101)

Значение статистики  𝑇 :

In [24]:
T = sigma2_F / sigma2_res
T

11.957776889088965

Зафиксируем уровень значимости 𝛼=0.05 . Для него найдём критическое значение 𝐹𝑐𝑟𝑖𝑡 :

In [25]:
from scipy import stats

In [26]:
alpha = 0.05

F_crit = stats.f.ppf(1 - alpha, k1, k2)
F_crit

3.0106398230773244

Видим, что 𝑇>𝐹𝑐𝑟𝑖𝑡 , поэтому заключаем, что размер компании влияет на заработную плату сотрудника. <br>
Вывод: Mожно заметить тенденцию из посчитанным медианам и средним: в компаниях класса S самые маленькие зарплаты, в компаниях M средний уровень зарплат выше, чем у S и ниже, чем у L, однако медиана у M больше, чем у L, что говорит о том, что более высоких зарплат там больше в крупных компаниях.

#### 2. Рассмотрим, как изменилась заработная плата в компаниях разных размеров за последние года. За основу возьмем данные о з/п в долларах США

In [27]:
sample2 = df[['salary_in_usd', 'company_size', 'work_year']]
sample2

     salary_in_usd company_size  work_year
0            79833            L       2020
1           260000            S       2020
2           109024            M       2020
3            20000            S       2020
4           150000            L       2020
..             ...          ...        ...
602         154000            M       2022
603         126000            M       2022
604         129000            M       2022
605         150000            M       2022
606         200000            L       2022

[607 rows x 3 columns]

In [28]:
sample2['work_year'].value_counts()

2022    318
2021    217
2020     72
Name: work_year, dtype: int64

В рассматриваемом датасете есть информация только о 3х годах: 2020, 2021 и 2022.

In [40]:
# рассмотрим данные 3х лет для компаний S:
S2 = sample2[sample2['company_size'] == 'S']
S2

     salary_in_usd company_size  work_year
1           260000            S       2020
3            20000            S       2020
6           190000            S       2020
9           125000            S       2020
10           51321            S       2020
..             ...          ...        ...
510         150000            S       2022
512          65000            S       2022
513          71444            S       2022
515          48000            S       2022
522          20000            S       2022

[83 rows x 3 columns]

In [41]:
S2 = S2.drop(columns='company_size') 
S2

     salary_in_usd  work_year
1           260000       2020
3            20000       2020
6           190000       2020
9           125000       2020
10           51321       2020
..             ...        ...
510         150000       2022
512          65000       2022
513          71444       2022
515          48000       2022
522          20000       2022

[83 rows x 2 columns]

In [59]:
#данные для 2020 года для компании S:
S2020 = S2[S2['work_year'] == 2020]

In [49]:
Smean2020 = S2020.mean()
Smean2020

salary_in_usd    70958.56
work_year         2020.00
dtype: float64

In [47]:
Smean2020.median()

36489.28

In [51]:
#данные для 2021 года для компании S:
S2021 = S2[S2['work_year'] == 2021]

In [54]:
Smean2021 = S2021.mean()
Smean2021

salary_in_usd    81509.844444
work_year         2021.000000
dtype: float64

In [55]:
Smean2021.median()

41765.42222222222

In [56]:
#данные для 2022 года для компании S:
S2022 = S2[S2['work_year'] == 2022]

In [57]:
Smean2022 = S2022.mean()
Smean2022

salary_in_usd    77046.538462
work_year         2022.000000
dtype: float64

In [58]:
Smean2022.median()

39534.269230769234

Для компаний S произошел следующий сдвиг: <br>
    в 2021 году заработная плата была выше, чем в 2х других рассмотренных годах <br>
    в 2022 году з/п была ниже, чем в 2021, но выше, чем в 2020 <br>
Можно сделать предположение, что уровень з/п для маленьких компаний не сильно влияет на год, скорей всего на показатель уровня з/п влияет какой-то другой более сильный показатель (например, курс валюты по отношению к доллару). <br>
2021>2022>2020

In [61]:
# рассмотрим данные 3х лет для компаний M:
M2 = sample2[sample2['company_size'] == 'M']
M2

     salary_in_usd company_size  work_year
2           109024            M       2020
12           39916            M       2020
18            5707            M       2020
19           56000            M       2020
20           43331            M       2020
..             ...          ...        ...
601          52000            M       2022
602         154000            M       2022
603         126000            M       2022
604         129000            M       2022
605         150000            M       2022

[326 rows x 3 columns]

In [62]:
M2 = M2.drop(columns='company_size') 
M2

     salary_in_usd  work_year
2           109024       2020
12           39916       2020
18            5707       2020
19           56000       2020
20           43331       2020
..             ...        ...
601          52000       2022
602         154000       2022
603         126000       2022
604         129000       2022
605         150000       2022

[326 rows x 2 columns]

In [63]:
#данные для 2020 года для компании M:
M2020 = M2[M2['work_year'] == 2020]

In [64]:
Mmean2020 = M2020.mean()
Mmean2020

salary_in_usd    115467.5
work_year          2020.0
dtype: float64

In [65]:
Mmean2020.median()

58743.75

In [66]:
#данные для 2021 года для компании M:
M2021 = M2[M2['work_year'] == 2021]

In [67]:
Mmean2021 = M2021.mean()
Mmean2021

salary_in_usd    74154.792453
work_year         2021.000000
dtype: float64

In [68]:
Mmean2021.median()

38087.8962264151

In [69]:
#данные для 2022 года для компании M:
M2022 = M2[M2['work_year'] == 2022]

In [70]:
Mmean2022 = M2022.mean()
Mmean2022

salary_in_usd    125731.401544
work_year          2022.000000
dtype: float64

In [71]:
Mmean2022.median()

63876.70077220077

Для компаний M произошел следующий сдвиг: <br>
в 2022 году заработная плата была выше, чем в 2х других рассмотренных годах<br>
в 2020 году з/п была ниже, чем в 2022, но выше, чем в 2021<br>
Можно сделать предположение, что уровень з/п для маленьких компаний не сильно влияет на год, скорей всего на показатель уровня з/п влияет какой-то другой более сильный показатель (например, курс валюты по отношению к доллару).<br>
2022>2020>2021

In [72]:
# рассмотрим данные 3х лет для компаний L:
L2 = sample2[sample2['company_size'] == 'L']
L2

     salary_in_usd company_size  work_year
0            79833            L       2020
4           150000            L       2020
5            72000            L       2020
7            35735            L       2020
8           135000            L       2020
..             ...          ...        ...
524         135000            L       2022
525         177000            L       2022
550         205300            L       2022
551         140400            L       2022
606         200000            L       2022

[198 rows x 3 columns]

In [73]:
L2 = L2.drop(columns='company_size') 
L2

     salary_in_usd  work_year
0            79833       2020
4           150000       2020
5            72000       2020
7            35735       2020
8           135000       2020
..             ...        ...
524         135000       2022
525         177000       2022
550         205300       2022
551         140400       2022
606         200000       2022

[198 rows x 2 columns]

In [74]:
#данные для 2020 года для компании L:
L2020 = L2[L2['work_year'] == 2020]

In [75]:
Lmean2020 = L2020.mean()
Lmean2020

salary_in_usd    106303.848485
work_year          2020.000000
dtype: float64

In [76]:
Lmean2020.median()

54161.92424242424

In [77]:
#данные для 2021 года для компании L:
L2021 = L2[L2['work_year'] == 2021]

In [78]:
Lmean2021 = L2021.mean()
Lmean2021

salary_in_usd    118236.352941
work_year          2021.000000
dtype: float64

In [79]:
Lmean2021.median()

60128.67647058824

In [80]:
#данные для 2022 года для компании L:
L2022 = L2[L2['work_year'] == 2022]

In [81]:
Lmean2022 = L2022.mean()
Lmean2022

salary_in_usd    131129.565217
work_year          2022.000000
dtype: float64

In [82]:
Lmean2022.median()

66575.78260869565

Для компаний L произошел следующий сдвиг: <br>
в 2022 году заработная плата была выше, чем в 2х других рассматриваемых годах<br>
в 2021 году з/п была  выше, чем в 2020<br>
Для компаний этой группы прослеживается тенденция роста з/п от года отслеживания - чем больше год, тем больше з/п .<br>
2022>2021>2020

Вывод: можно сказать, что данный признак имеет разный коэффициент влияния на каждую из групп компаний.